#  Найдите сумму цифр трехзначного числа.

# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |


n = int(input("Введите трехзначное число: "))

result1= (n // 100)
result2=(n // 10)%10
result3 =(n % 10)

print("сумма цифр",result1+result2+result3)

